'# GIT - это распределенная система контроля версий'

# Это система для отслеживания и ведения истории изменения файлов в нашем проекте. При помощи git можно организовать командную работу

'GitHub'
# это веб-сайт для размещения git-репозиториев в совместной разработке проектов.

# Репозиторий - это хранилище нашего кода и истории его изменений

# код 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

# команды GIT
# 1. git init - создает удаленный репозиторий, в той директории, в которой была прописана команда.
# 1. git add. - команда для добавления изменений в систему отслеживания гита. (вместо точки можно прописать название директории)
# 3. git cimmit -m 'something' - это команда для сохранения всех изменений с комментарием к ним.
# 4. gir branch -M main - это команда переименовывает главную ветку master на  main.
# 5. git remote add origin 'url' - эта команда связывавает наш локальный репозитроий с удаленным репозиторием на гитхабе.
# 6. git push origin <main> - это команда отправки наших изменений на удаленный репозиторий.

'==================================================================='
# git status - показывает статус репозитория (какие изменения не закончены)
# git branch - показывает на какой ветке вы находитесь. 